tap "teamookla/speedtest"
brew "python@3.13"
brew "awscli"
brew "bat"
brew "btop"
brew "cloc"
brew "fzf"
brew "gh"
brew "git"
brew "gitleaks"
brew "go"
brew "helm"
brew "incus"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "lefthook"
brew "libpq"
brew "mypy"
brew "neovim"
brew "nmap"
brew "node"
brew "openjdk"
brew "poetry"
brew "pre-commit"
brew "python@3.10"
brew "python@3.12"
brew "python@3.9"
brew "rclone"
brew "rust"
brew "starship"
brew "stow"
brew "stress"
brew "terraform"
brew "tflint"
brew "tmux"
brew "tree"
brew "uv"
brew "yamlfmt"
brew "yazi", args: ["HEAD"]
brew "yt-dlp"
brew "teamookla/speedtest/speedtest"
cask "betterdisplay"
cask "bitwarden"
cask "discord"
cask "firefox"
cask "hiddenbar"
cask "iterm2"
cask "keepassxc"
cask "maccy"
cask "orbstack"
cask "postman"
cask "raycast"
cask "telegram"
cask "zen"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "charliermarsh.ruff"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "imzivko.cursor-dark-core"
vscode "jamesmaj.easy-icons"
vscode "lunuan.kubernetes-templates"
vscode "matangover.mypy"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "nefrob.vscode-just-syntax"
vscode "pkief.material-icon-theme"
vscode "qufiwefefwoyn.kanagawa"
vscode "redhat.vscode-yaml"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "william-voyek.vscode-nginx"
vscode "yzhang.markdown-all-in-one"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
